earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# DatanoiseTV PicoADK (Picoprobe)
# -----------------------------------
datanoisetv_picoadkpicoprobe.name=DatanoiseTV PicoADK (Picoprobe)
datanoisetv_picoadkpicoprobe.vid.0=0x2e8a
datanoisetv_picoadkpicoprobe.pid.0=0x0004
datanoisetv_picoadkpicoprobe.vid.1=0x2e8a
datanoisetv_picoadkpicoprobe.pid.1=0x0104
datanoisetv_picoadkpicoprobe.vid.2=0x2e8a
datanoisetv_picoadkpicoprobe.pid.2=0x4004
datanoisetv_picoadkpicoprobe.vid.3=0x2e8a
datanoisetv_picoadkpicoprobe.pid.3=0x4104
datanoisetv_picoadkpicoprobe.vid.4=0x2e8a
datanoisetv_picoadkpicoprobe.pid.4=0x8004
datanoisetv_picoadkpicoprobe.vid.5=0x2e8a
datanoisetv_picoadkpicoprobe.pid.5=0x8104
datanoisetv_picoadkpicoprobe.vid.6=0x2e8a
datanoisetv_picoadkpicoprobe.pid.6=0xc004
datanoisetv_picoadkpicoprobe.vid.7=0x2e8a
datanoisetv_picoadkpicoprobe.pid.7=0xc104
datanoisetv_picoadkpicoprobe.build.usbpid=-DSERIALUSB_PID=0x000a
datanoisetv_picoadkpicoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=250
datanoisetv_picoadkpicoprobe.build.board=DATANOISETV_PICOADK
datanoisetv_picoadkpicoprobe.build.mcu=cortex-m0plus
datanoisetv_picoadkpicoprobe.build.variant=datanoisetv_picoadk
datanoisetv_picoadkpicoprobe.upload.tool=picoprobe
datanoisetv_picoadkpicoprobe.upload.tool.default=picoprobe
datanoisetv_picoadkpicoprobe.upload.maximum_size=2097152
datanoisetv_picoadkpicoprobe.upload.maximum_data_size=262144
datanoisetv_picoadkpicoprobe.upload.wait_for_upload_port=true
datanoisetv_picoadkpicoprobe.upload.erase_cmd=
datanoisetv_picoadkpicoprobe.serial.disableDTR=false
datanoisetv_picoadkpicoprobe.serial.disableRTS=false
datanoisetv_picoadkpicoprobe.build.f_cpu=125000000
datanoisetv_picoadkpicoprobe.build.led=
datanoisetv_picoadkpicoprobe.build.core=rp2040
datanoisetv_picoadkpicoprobe.build.ldscript=memmap_default.ld
datanoisetv_picoadkpicoprobe.build.ram_length=256k
datanoisetv_picoadkpicoprobe.build.debugscript=picoprobe.tcl
datanoisetv_picoadkpicoprobe.build.boot2=boot2_w25q080_2_padded_checksum
datanoisetv_picoadkpicoprobe.build.vid=0x2e8a
datanoisetv_picoadkpicoprobe.build.pid=0x000a
datanoisetv_picoadkpicoprobe.build.usb_manufacturer="DatanoiseTV"
datanoisetv_picoadkpicoprobe.build.usb_product="PicoADK (Picoprobe)"
datanoisetv_picoadkpicoprobe.menu.flash.2097152_0=2MB (no FS)
datanoisetv_picoadkpicoprobe.menu.flash.2097152_0.upload.maximum_size=2093056
datanoisetv_picoadkpicoprobe.menu.flash.2097152_0.build.flash_length=2093056
datanoisetv_picoadkpicoprobe.menu.flash.2097152_0.build.eeprom_start=270528512
datanoisetv_picoadkpicoprobe.menu.flash.2097152_0.build.fs_start=270528512
datanoisetv_picoadkpicoprobe.menu.flash.2097152_0.build.fs_end=270528512
datanoisetv_picoadkpicoprobe.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
datanoisetv_picoadkpicoprobe.menu.flash.2097152_65536.upload.maximum_size=2027520
datanoisetv_picoadkpicoprobe.menu.flash.2097152_65536.build.flash_length=2027520
datanoisetv_picoadkpicoprobe.menu.flash.2097152_65536.build.eeprom_start=270528512
datanoisetv_picoadkpicoprobe.menu.flash.2097152_65536.build.fs_start=270462976
datanoisetv_picoadkpicoprobe.menu.flash.2097152_65536.build.fs_end=270528512
datanoisetv_picoadkpicoprobe.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
datanoisetv_picoadkpicoprobe.menu.flash.2097152_131072.upload.maximum_size=1961984
datanoisetv_picoadkpicoprobe.menu.flash.2097152_131072.build.flash_length=1961984
datanoisetv_picoadkpicoprobe.menu.flash.2097152_131072.build.eeprom_start=270528512
datanoisetv_picoadkpicoprobe.menu.flash.2097152_131072.build.fs_start=270397440
datanoisetv_picoadkpicoprobe.menu.flash.2097152_131072.build.fs_end=270528512
datanoisetv_picoadkpicoprobe.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
datanoisetv_picoadkpicoprobe.menu.flash.2097152_262144.upload.maximum_size=1830912
datanoisetv_picoadkpicoprobe.menu.flash.2097152_262144.build.flash_length=1830912
datanoisetv_picoadkpicoprobe.menu.flash.2097152_262144.build.eeprom_start=270528512
datanoisetv_picoadkpicoprobe.menu.flash.2097152_262144.build.fs_start=270266368
datanoisetv_picoadkpicoprobe.menu.flash.2097152_262144.build.fs_end=270528512
datanoisetv_picoadkpicoprobe.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
datanoisetv_picoadkpicoprobe.menu.flash.2097152_524288.upload.maximum_size=1568768
datanoisetv_picoadkpicoprobe.menu.flash.2097152_524288.build.flash_length=1568768
datanoisetv_picoadkpicoprobe.menu.flash.2097152_524288.build.eeprom_start=270528512
datanoisetv_picoadkpicoprobe.menu.flash.2097152_524288.build.fs_start=270004224
datanoisetv_picoadkpicoprobe.menu.flash.2097152_524288.build.fs_end=270528512
datanoisetv_picoadkpicoprobe.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
datanoisetv_picoadkpicoprobe.menu.flash.2097152_1048576.upload.maximum_size=1044480
datanoisetv_picoadkpicoprobe.menu.flash.2097152_1048576.build.flash_length=1044480
datanoisetv_picoadkpicoprobe.menu.flash.2097152_1048576.build.eeprom_start=270528512
datanoisetv_picoadkpicoprobe.menu.flash.2097152_1048576.build.fs_start=269479936
datanoisetv_picoadkpicoprobe.menu.flash.2097152_1048576.build.fs_end=270528512
datanoisetv_picoadkpicoprobe.menu.freq.133=133 MHz
datanoisetv_picoadkpicoprobe.menu.freq.133.build.f_cpu=133000000L
datanoisetv_picoadkpicoprobe.menu.freq.50=50 MHz
datanoisetv_picoadkpicoprobe.menu.freq.50.build.f_cpu=50000000L
datanoisetv_picoadkpicoprobe.menu.freq.100=100 MHz
datanoisetv_picoadkpicoprobe.menu.freq.100.build.f_cpu=100000000L
datanoisetv_picoadkpicoprobe.menu.freq.120=120 MHz
datanoisetv_picoadkpicoprobe.menu.freq.120.build.f_cpu=120000000L
datanoisetv_picoadkpicoprobe.menu.freq.125=125 MHz
datanoisetv_picoadkpicoprobe.menu.freq.125.build.f_cpu=125000000L
datanoisetv_picoadkpicoprobe.menu.freq.150=150 MHz (Overclock)
datanoisetv_picoadkpicoprobe.menu.freq.150.build.f_cpu=150000000L
datanoisetv_picoadkpicoprobe.menu.freq.175=175 MHz (Overclock)
datanoisetv_picoadkpicoprobe.menu.freq.175.build.f_cpu=175000000L
datanoisetv_picoadkpicoprobe.menu.freq.200=200 MHz (Overclock)
datanoisetv_picoadkpicoprobe.menu.freq.200.build.f_cpu=200000000L
datanoisetv_picoadkpicoprobe.menu.freq.225=225 MHz (Overclock)
datanoisetv_picoadkpicoprobe.menu.freq.225.build.f_cpu=225000000L
datanoisetv_picoadkpicoprobe.menu.freq.240=240 MHz (Overclock)
datanoisetv_picoadkpicoprobe.menu.freq.240.build.f_cpu=240000000L
datanoisetv_picoadkpicoprobe.menu.freq.250=250 MHz (Overclock)
datanoisetv_picoadkpicoprobe.menu.freq.250.build.f_cpu=250000000L
datanoisetv_picoadkpicoprobe.menu.freq.275=275 MHz (Overclock)
datanoisetv_picoadkpicoprobe.menu.freq.275.build.f_cpu=275000000L
datanoisetv_picoadkpicoprobe.menu.freq.300=300 MHz (Overclock)
datanoisetv_picoadkpicoprobe.menu.freq.300.build.f_cpu=300000000L
datanoisetv_picoadkpicoprobe.menu.opt.Small=Small (-Os) (standard)
datanoisetv_picoadkpicoprobe.menu.opt.Small.build.flags.optimize=-Os
datanoisetv_picoadkpicoprobe.menu.opt.Optimize=Optimize (-O)
datanoisetv_picoadkpicoprobe.menu.opt.Optimize.build.flags.optimize=-O
datanoisetv_picoadkpicoprobe.menu.opt.Optimize2=Optimize More (-O2)
datanoisetv_picoadkpicoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
datanoisetv_picoadkpicoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
datanoisetv_picoadkpicoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
datanoisetv_picoadkpicoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
datanoisetv_picoadkpicoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
datanoisetv_picoadkpicoprobe.menu.opt.Debug=Debug (-Og)
datanoisetv_picoadkpicoprobe.menu.opt.Debug.build.flags.optimize=-Og
datanoisetv_picoadkpicoprobe.menu.rtti.Disabled=Disabled
datanoisetv_picoadkpicoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
datanoisetv_picoadkpicoprobe.menu.rtti.Enabled=Enabled
datanoisetv_picoadkpicoprobe.menu.rtti.Enabled.build.flags.rtti=
datanoisetv_picoadkpicoprobe.menu.stackprotect.Disabled=Disabled
datanoisetv_picoadkpicoprobe.menu.stackprotect.Disabled.build.flags.stackprotect=
datanoisetv_picoadkpicoprobe.menu.stackprotect.Enabled=Enabled
datanoisetv_picoadkpicoprobe.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
datanoisetv_picoadkpicoprobe.menu.exceptions.Disabled=Disabled
datanoisetv_picoadkpicoprobe.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
datanoisetv_picoadkpicoprobe.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
datanoisetv_picoadkpicoprobe.menu.exceptions.Enabled=Enabled
datanoisetv_picoadkpicoprobe.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
datanoisetv_picoadkpicoprobe.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
datanoisetv_picoadkpicoprobe.menu.dbgport.Disabled=Disabled
datanoisetv_picoadkpicoprobe.menu.dbgport.Disabled.build.debug_port=
datanoisetv_picoadkpicoprobe.menu.dbgport.Serial=Serial
datanoisetv_picoadkpicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
datanoisetv_picoadkpicoprobe.menu.dbgport.Serial1=Serial1
datanoisetv_picoadkpicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
datanoisetv_picoadkpicoprobe.menu.dbgport.Serial2=Serial2
datanoisetv_picoadkpicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
datanoisetv_picoadkpicoprobe.menu.dbglvl.None=None
datanoisetv_picoadkpicoprobe.menu.dbglvl.None.build.debug_level=
datanoisetv_picoadkpicoprobe.menu.dbglvl.Core=Core
datanoisetv_picoadkpicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
datanoisetv_picoadkpicoprobe.menu.dbglvl.SPI=SPI
datanoisetv_picoadkpicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
datanoisetv_picoadkpicoprobe.menu.dbglvl.Wire=Wire
datanoisetv_picoadkpicoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
datanoisetv_picoadkpicoprobe.menu.dbglvl.All=All
datanoisetv_picoadkpicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
datanoisetv_picoadkpicoprobe.menu.dbglvl.NDEBUG=NDEBUG
datanoisetv_picoadkpicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
datanoisetv_picoadkpicoprobe.menu.usbstack.picosdk=Pico SDK
datanoisetv_picoadkpicoprobe.menu.usbstack.picosdk.build.usbstack_flags=
datanoisetv_picoadkpicoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
datanoisetv_picoadkpicoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
datanoisetv_picoadkpicoprobe.menu.usbstack.nousb=No USB
datanoisetv_picoadkpicoprobe.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
datanoisetv_picoadkpicoprobe.menu.ipstack.ipv4only=IPv4 Only
datanoisetv_picoadkpicoprobe.menu.ipstack.ipv4only.build.libpico=libpico.a
datanoisetv_picoadkpicoprobe.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
datanoisetv_picoadkpicoprobe.menu.ipstack.ipv4ipv6=IPv4 and IPv6
datanoisetv_picoadkpicoprobe.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
datanoisetv_picoadkpicoprobe.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

