earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# ElectronicCats HunterCat NFC RP2040 (Picoprobe)
# -----------------------------------
electroniccats_huntercat_nfcpicoprobe.name=ElectronicCats HunterCat NFC RP2040 (Picoprobe)
electroniccats_huntercat_nfcpicoprobe.vid.0=0x2E8A
electroniccats_huntercat_nfcpicoprobe.pid.0=0x0004
electroniccats_huntercat_nfcpicoprobe.vid.1=0x2E8A
electroniccats_huntercat_nfcpicoprobe.pid.1=0x0104
electroniccats_huntercat_nfcpicoprobe.vid.2=0x2E8A
electroniccats_huntercat_nfcpicoprobe.pid.2=0x4004
electroniccats_huntercat_nfcpicoprobe.vid.3=0x2E8A
electroniccats_huntercat_nfcpicoprobe.pid.3=0x4104
electroniccats_huntercat_nfcpicoprobe.vid.4=0x2E8A
electroniccats_huntercat_nfcpicoprobe.pid.4=0x8004
electroniccats_huntercat_nfcpicoprobe.vid.5=0x2E8A
electroniccats_huntercat_nfcpicoprobe.pid.5=0x8104
electroniccats_huntercat_nfcpicoprobe.vid.6=0x2E8A
electroniccats_huntercat_nfcpicoprobe.pid.6=0xc004
electroniccats_huntercat_nfcpicoprobe.vid.7=0x2E8A
electroniccats_huntercat_nfcpicoprobe.pid.7=0xc104
electroniccats_huntercat_nfcpicoprobe.build.usbpid=-DSERIALUSB_PID=0x1037
electroniccats_huntercat_nfcpicoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=500
electroniccats_huntercat_nfcpicoprobe.build.board=ELECTRONICCATS_HUNTERCAT_NFC
electroniccats_huntercat_nfcpicoprobe.build.mcu=cortex-m0plus
electroniccats_huntercat_nfcpicoprobe.build.variant=electroniccats_huntercat_nfc
electroniccats_huntercat_nfcpicoprobe.upload.tool=picoprobe
electroniccats_huntercat_nfcpicoprobe.upload.tool.default=picoprobe
electroniccats_huntercat_nfcpicoprobe.upload.maximum_size=2097152
electroniccats_huntercat_nfcpicoprobe.upload.maximum_data_size=262144
electroniccats_huntercat_nfcpicoprobe.upload.wait_for_upload_port=true
electroniccats_huntercat_nfcpicoprobe.upload.erase_cmd=
electroniccats_huntercat_nfcpicoprobe.serial.disableDTR=false
electroniccats_huntercat_nfcpicoprobe.serial.disableRTS=false
electroniccats_huntercat_nfcpicoprobe.build.f_cpu=125000000
electroniccats_huntercat_nfcpicoprobe.build.led=
electroniccats_huntercat_nfcpicoprobe.build.core=rp2040
electroniccats_huntercat_nfcpicoprobe.build.ldscript=memmap_default.ld
electroniccats_huntercat_nfcpicoprobe.build.ram_length=256k
electroniccats_huntercat_nfcpicoprobe.build.debugscript=picoprobe.tcl
electroniccats_huntercat_nfcpicoprobe.build.boot2=boot2_w25q080_2_padded_checksum
electroniccats_huntercat_nfcpicoprobe.build.vid=0x2E8A
electroniccats_huntercat_nfcpicoprobe.build.pid=0x1037
electroniccats_huntercat_nfcpicoprobe.build.usb_manufacturer="ElectronicCats"
electroniccats_huntercat_nfcpicoprobe.build.usb_product="HunterCat NFC RP2040 (Picoprobe)"
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_0=2MB (no FS)
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_0.upload.maximum_size=2093056
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_0.build.flash_length=2093056
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_0.build.eeprom_start=270528512
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_0.build.fs_start=270528512
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_0.build.fs_end=270528512
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_65536.upload.maximum_size=2027520
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_65536.build.flash_length=2027520
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_65536.build.eeprom_start=270528512
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_65536.build.fs_start=270462976
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_65536.build.fs_end=270528512
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_131072.upload.maximum_size=1961984
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_131072.build.flash_length=1961984
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_131072.build.eeprom_start=270528512
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_131072.build.fs_start=270397440
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_131072.build.fs_end=270528512
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_262144.upload.maximum_size=1830912
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_262144.build.flash_length=1830912
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_262144.build.eeprom_start=270528512
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_262144.build.fs_start=270266368
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_262144.build.fs_end=270528512
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_524288.upload.maximum_size=1568768
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_524288.build.flash_length=1568768
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_524288.build.eeprom_start=270528512
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_524288.build.fs_start=270004224
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_524288.build.fs_end=270528512
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_1048576.upload.maximum_size=1044480
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_1048576.build.flash_length=1044480
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_1048576.build.eeprom_start=270528512
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_1048576.build.fs_start=269479936
electroniccats_huntercat_nfcpicoprobe.menu.flash.2097152_1048576.build.fs_end=270528512
electroniccats_huntercat_nfcpicoprobe.menu.freq.133=133 MHz
electroniccats_huntercat_nfcpicoprobe.menu.freq.133.build.f_cpu=133000000L
electroniccats_huntercat_nfcpicoprobe.menu.freq.50=50 MHz
electroniccats_huntercat_nfcpicoprobe.menu.freq.50.build.f_cpu=50000000L
electroniccats_huntercat_nfcpicoprobe.menu.freq.100=100 MHz
electroniccats_huntercat_nfcpicoprobe.menu.freq.100.build.f_cpu=100000000L
electroniccats_huntercat_nfcpicoprobe.menu.freq.120=120 MHz
electroniccats_huntercat_nfcpicoprobe.menu.freq.120.build.f_cpu=120000000L
electroniccats_huntercat_nfcpicoprobe.menu.freq.125=125 MHz
electroniccats_huntercat_nfcpicoprobe.menu.freq.125.build.f_cpu=125000000L
electroniccats_huntercat_nfcpicoprobe.menu.freq.150=150 MHz (Overclock)
electroniccats_huntercat_nfcpicoprobe.menu.freq.150.build.f_cpu=150000000L
electroniccats_huntercat_nfcpicoprobe.menu.freq.175=175 MHz (Overclock)
electroniccats_huntercat_nfcpicoprobe.menu.freq.175.build.f_cpu=175000000L
electroniccats_huntercat_nfcpicoprobe.menu.freq.200=200 MHz (Overclock)
electroniccats_huntercat_nfcpicoprobe.menu.freq.200.build.f_cpu=200000000L
electroniccats_huntercat_nfcpicoprobe.menu.freq.225=225 MHz (Overclock)
electroniccats_huntercat_nfcpicoprobe.menu.freq.225.build.f_cpu=225000000L
electroniccats_huntercat_nfcpicoprobe.menu.freq.240=240 MHz (Overclock)
electroniccats_huntercat_nfcpicoprobe.menu.freq.240.build.f_cpu=240000000L
electroniccats_huntercat_nfcpicoprobe.menu.freq.250=250 MHz (Overclock)
electroniccats_huntercat_nfcpicoprobe.menu.freq.250.build.f_cpu=250000000L
electroniccats_huntercat_nfcpicoprobe.menu.freq.275=275 MHz (Overclock)
electroniccats_huntercat_nfcpicoprobe.menu.freq.275.build.f_cpu=275000000L
electroniccats_huntercat_nfcpicoprobe.menu.freq.300=300 MHz (Overclock)
electroniccats_huntercat_nfcpicoprobe.menu.freq.300.build.f_cpu=300000000L
electroniccats_huntercat_nfcpicoprobe.menu.opt.Small=Small (-Os) (standard)
electroniccats_huntercat_nfcpicoprobe.menu.opt.Small.build.flags.optimize=-Os
electroniccats_huntercat_nfcpicoprobe.menu.opt.Optimize=Optimize (-O)
electroniccats_huntercat_nfcpicoprobe.menu.opt.Optimize.build.flags.optimize=-O
electroniccats_huntercat_nfcpicoprobe.menu.opt.Optimize2=Optimize More (-O2)
electroniccats_huntercat_nfcpicoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
electroniccats_huntercat_nfcpicoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
electroniccats_huntercat_nfcpicoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
electroniccats_huntercat_nfcpicoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
electroniccats_huntercat_nfcpicoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
electroniccats_huntercat_nfcpicoprobe.menu.opt.Debug=Debug (-Og)
electroniccats_huntercat_nfcpicoprobe.menu.opt.Debug.build.flags.optimize=-Og
electroniccats_huntercat_nfcpicoprobe.menu.rtti.Disabled=Disabled
electroniccats_huntercat_nfcpicoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
electroniccats_huntercat_nfcpicoprobe.menu.rtti.Enabled=Enabled
electroniccats_huntercat_nfcpicoprobe.menu.rtti.Enabled.build.flags.rtti=
electroniccats_huntercat_nfcpicoprobe.menu.stackprotect.Disabled=Disabled
electroniccats_huntercat_nfcpicoprobe.menu.stackprotect.Disabled.build.flags.stackprotect=
electroniccats_huntercat_nfcpicoprobe.menu.stackprotect.Enabled=Enabled
electroniccats_huntercat_nfcpicoprobe.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
electroniccats_huntercat_nfcpicoprobe.menu.exceptions.Disabled=Disabled
electroniccats_huntercat_nfcpicoprobe.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
electroniccats_huntercat_nfcpicoprobe.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
electroniccats_huntercat_nfcpicoprobe.menu.exceptions.Enabled=Enabled
electroniccats_huntercat_nfcpicoprobe.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
electroniccats_huntercat_nfcpicoprobe.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
electroniccats_huntercat_nfcpicoprobe.menu.dbgport.Disabled=Disabled
electroniccats_huntercat_nfcpicoprobe.menu.dbgport.Disabled.build.debug_port=
electroniccats_huntercat_nfcpicoprobe.menu.dbgport.Serial=Serial
electroniccats_huntercat_nfcpicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
electroniccats_huntercat_nfcpicoprobe.menu.dbgport.Serial1=Serial1
electroniccats_huntercat_nfcpicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
electroniccats_huntercat_nfcpicoprobe.menu.dbgport.Serial2=Serial2
electroniccats_huntercat_nfcpicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
electroniccats_huntercat_nfcpicoprobe.menu.dbglvl.None=None
electroniccats_huntercat_nfcpicoprobe.menu.dbglvl.None.build.debug_level=
electroniccats_huntercat_nfcpicoprobe.menu.dbglvl.Core=Core
electroniccats_huntercat_nfcpicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
electroniccats_huntercat_nfcpicoprobe.menu.dbglvl.SPI=SPI
electroniccats_huntercat_nfcpicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
electroniccats_huntercat_nfcpicoprobe.menu.dbglvl.Wire=Wire
electroniccats_huntercat_nfcpicoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
electroniccats_huntercat_nfcpicoprobe.menu.dbglvl.All=All
electroniccats_huntercat_nfcpicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
electroniccats_huntercat_nfcpicoprobe.menu.dbglvl.NDEBUG=NDEBUG
electroniccats_huntercat_nfcpicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
electroniccats_huntercat_nfcpicoprobe.menu.usbstack.picosdk=Pico SDK
electroniccats_huntercat_nfcpicoprobe.menu.usbstack.picosdk.build.usbstack_flags=
electroniccats_huntercat_nfcpicoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
electroniccats_huntercat_nfcpicoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
electroniccats_huntercat_nfcpicoprobe.menu.usbstack.nousb=No USB
electroniccats_huntercat_nfcpicoprobe.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
electroniccats_huntercat_nfcpicoprobe.menu.ipstack.ipv4only=IPv4 Only
electroniccats_huntercat_nfcpicoprobe.menu.ipstack.ipv4only.build.libpico=libpico.a
electroniccats_huntercat_nfcpicoprobe.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
electroniccats_huntercat_nfcpicoprobe.menu.ipstack.ipv4ipv6=IPv4 and IPv6
electroniccats_huntercat_nfcpicoprobe.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
electroniccats_huntercat_nfcpicoprobe.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

