earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# nullbits Bit-C PRO (Picoprobe)
# -----------------------------------
nullbits_bit_c_propicoprobe.name=nullbits Bit-C PRO (Picoprobe)
nullbits_bit_c_propicoprobe.vid.0=0x2e8a
nullbits_bit_c_propicoprobe.pid.0=0x0004
nullbits_bit_c_propicoprobe.vid.1=0x2e8a
nullbits_bit_c_propicoprobe.pid.1=0x0104
nullbits_bit_c_propicoprobe.vid.2=0x2e8a
nullbits_bit_c_propicoprobe.pid.2=0x4004
nullbits_bit_c_propicoprobe.vid.3=0x2e8a
nullbits_bit_c_propicoprobe.pid.3=0x4104
nullbits_bit_c_propicoprobe.vid.4=0x2e8a
nullbits_bit_c_propicoprobe.pid.4=0x8004
nullbits_bit_c_propicoprobe.vid.5=0x2e8a
nullbits_bit_c_propicoprobe.pid.5=0x8104
nullbits_bit_c_propicoprobe.vid.6=0x2e8a
nullbits_bit_c_propicoprobe.pid.6=0xc004
nullbits_bit_c_propicoprobe.vid.7=0x2e8a
nullbits_bit_c_propicoprobe.pid.7=0xc104
nullbits_bit_c_propicoprobe.build.usbpid=-DSERIALUSB_PID=0x6e61
nullbits_bit_c_propicoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=500
nullbits_bit_c_propicoprobe.build.board=NULLBITS_BIT_C_PRO
nullbits_bit_c_propicoprobe.build.mcu=cortex-m0plus
nullbits_bit_c_propicoprobe.build.variant=nullbits_bit_c_pro
nullbits_bit_c_propicoprobe.upload.tool=picoprobe
nullbits_bit_c_propicoprobe.upload.tool.default=picoprobe
nullbits_bit_c_propicoprobe.upload.maximum_size=4194304
nullbits_bit_c_propicoprobe.upload.maximum_data_size=262144
nullbits_bit_c_propicoprobe.upload.wait_for_upload_port=true
nullbits_bit_c_propicoprobe.upload.erase_cmd=
nullbits_bit_c_propicoprobe.serial.disableDTR=false
nullbits_bit_c_propicoprobe.serial.disableRTS=false
nullbits_bit_c_propicoprobe.build.f_cpu=125000000
nullbits_bit_c_propicoprobe.build.led=
nullbits_bit_c_propicoprobe.build.core=rp2040
nullbits_bit_c_propicoprobe.build.ldscript=memmap_default.ld
nullbits_bit_c_propicoprobe.build.ram_length=256k
nullbits_bit_c_propicoprobe.build.debugscript=picoprobe.tcl
nullbits_bit_c_propicoprobe.build.boot2=boot2_w25x10cl_4_padded_checksum
nullbits_bit_c_propicoprobe.build.vid=0x2e8a
nullbits_bit_c_propicoprobe.build.pid=0x6e61
nullbits_bit_c_propicoprobe.build.usb_manufacturer="nullbits"
nullbits_bit_c_propicoprobe.build.usb_product="Bit-C PRO (Picoprobe)"
nullbits_bit_c_propicoprobe.menu.flash.4194304_0=4MB (no FS)
nullbits_bit_c_propicoprobe.menu.flash.4194304_0.upload.maximum_size=4190208
nullbits_bit_c_propicoprobe.menu.flash.4194304_0.build.flash_length=4190208
nullbits_bit_c_propicoprobe.menu.flash.4194304_0.build.eeprom_start=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_0.build.fs_start=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_0.build.fs_end=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_65536=4MB (Sketch: 4032KB, FS: 64KB)
nullbits_bit_c_propicoprobe.menu.flash.4194304_65536.upload.maximum_size=4124672
nullbits_bit_c_propicoprobe.menu.flash.4194304_65536.build.flash_length=4124672
nullbits_bit_c_propicoprobe.menu.flash.4194304_65536.build.eeprom_start=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_65536.build.fs_start=272560128
nullbits_bit_c_propicoprobe.menu.flash.4194304_65536.build.fs_end=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_131072=4MB (Sketch: 3968KB, FS: 128KB)
nullbits_bit_c_propicoprobe.menu.flash.4194304_131072.upload.maximum_size=4059136
nullbits_bit_c_propicoprobe.menu.flash.4194304_131072.build.flash_length=4059136
nullbits_bit_c_propicoprobe.menu.flash.4194304_131072.build.eeprom_start=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_131072.build.fs_start=272494592
nullbits_bit_c_propicoprobe.menu.flash.4194304_131072.build.fs_end=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_262144=4MB (Sketch: 3840KB, FS: 256KB)
nullbits_bit_c_propicoprobe.menu.flash.4194304_262144.upload.maximum_size=3928064
nullbits_bit_c_propicoprobe.menu.flash.4194304_262144.build.flash_length=3928064
nullbits_bit_c_propicoprobe.menu.flash.4194304_262144.build.eeprom_start=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_262144.build.fs_start=272363520
nullbits_bit_c_propicoprobe.menu.flash.4194304_262144.build.fs_end=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_524288=4MB (Sketch: 3584KB, FS: 512KB)
nullbits_bit_c_propicoprobe.menu.flash.4194304_524288.upload.maximum_size=3665920
nullbits_bit_c_propicoprobe.menu.flash.4194304_524288.build.flash_length=3665920
nullbits_bit_c_propicoprobe.menu.flash.4194304_524288.build.eeprom_start=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_524288.build.fs_start=272101376
nullbits_bit_c_propicoprobe.menu.flash.4194304_524288.build.fs_end=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_1048576=4MB (Sketch: 3MB, FS: 1MB)
nullbits_bit_c_propicoprobe.menu.flash.4194304_1048576.upload.maximum_size=3141632
nullbits_bit_c_propicoprobe.menu.flash.4194304_1048576.build.flash_length=3141632
nullbits_bit_c_propicoprobe.menu.flash.4194304_1048576.build.eeprom_start=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_1048576.build.fs_start=271577088
nullbits_bit_c_propicoprobe.menu.flash.4194304_1048576.build.fs_end=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
nullbits_bit_c_propicoprobe.menu.flash.4194304_2097152.upload.maximum_size=2093056
nullbits_bit_c_propicoprobe.menu.flash.4194304_2097152.build.flash_length=2093056
nullbits_bit_c_propicoprobe.menu.flash.4194304_2097152.build.eeprom_start=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_2097152.build.fs_start=270528512
nullbits_bit_c_propicoprobe.menu.flash.4194304_2097152.build.fs_end=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
nullbits_bit_c_propicoprobe.menu.flash.4194304_3145728.upload.maximum_size=1044480
nullbits_bit_c_propicoprobe.menu.flash.4194304_3145728.build.flash_length=1044480
nullbits_bit_c_propicoprobe.menu.flash.4194304_3145728.build.eeprom_start=272625664
nullbits_bit_c_propicoprobe.menu.flash.4194304_3145728.build.fs_start=269479936
nullbits_bit_c_propicoprobe.menu.flash.4194304_3145728.build.fs_end=272625664
nullbits_bit_c_propicoprobe.menu.freq.133=133 MHz
nullbits_bit_c_propicoprobe.menu.freq.133.build.f_cpu=133000000L
nullbits_bit_c_propicoprobe.menu.freq.50=50 MHz
nullbits_bit_c_propicoprobe.menu.freq.50.build.f_cpu=50000000L
nullbits_bit_c_propicoprobe.menu.freq.100=100 MHz
nullbits_bit_c_propicoprobe.menu.freq.100.build.f_cpu=100000000L
nullbits_bit_c_propicoprobe.menu.freq.120=120 MHz
nullbits_bit_c_propicoprobe.menu.freq.120.build.f_cpu=120000000L
nullbits_bit_c_propicoprobe.menu.freq.125=125 MHz
nullbits_bit_c_propicoprobe.menu.freq.125.build.f_cpu=125000000L
nullbits_bit_c_propicoprobe.menu.freq.150=150 MHz (Overclock)
nullbits_bit_c_propicoprobe.menu.freq.150.build.f_cpu=150000000L
nullbits_bit_c_propicoprobe.menu.freq.175=175 MHz (Overclock)
nullbits_bit_c_propicoprobe.menu.freq.175.build.f_cpu=175000000L
nullbits_bit_c_propicoprobe.menu.freq.200=200 MHz (Overclock)
nullbits_bit_c_propicoprobe.menu.freq.200.build.f_cpu=200000000L
nullbits_bit_c_propicoprobe.menu.freq.225=225 MHz (Overclock)
nullbits_bit_c_propicoprobe.menu.freq.225.build.f_cpu=225000000L
nullbits_bit_c_propicoprobe.menu.freq.240=240 MHz (Overclock)
nullbits_bit_c_propicoprobe.menu.freq.240.build.f_cpu=240000000L
nullbits_bit_c_propicoprobe.menu.freq.250=250 MHz (Overclock)
nullbits_bit_c_propicoprobe.menu.freq.250.build.f_cpu=250000000L
nullbits_bit_c_propicoprobe.menu.freq.275=275 MHz (Overclock)
nullbits_bit_c_propicoprobe.menu.freq.275.build.f_cpu=275000000L
nullbits_bit_c_propicoprobe.menu.freq.300=300 MHz (Overclock)
nullbits_bit_c_propicoprobe.menu.freq.300.build.f_cpu=300000000L
nullbits_bit_c_propicoprobe.menu.opt.Small=Small (-Os) (standard)
nullbits_bit_c_propicoprobe.menu.opt.Small.build.flags.optimize=-Os
nullbits_bit_c_propicoprobe.menu.opt.Optimize=Optimize (-O)
nullbits_bit_c_propicoprobe.menu.opt.Optimize.build.flags.optimize=-O
nullbits_bit_c_propicoprobe.menu.opt.Optimize2=Optimize More (-O2)
nullbits_bit_c_propicoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
nullbits_bit_c_propicoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
nullbits_bit_c_propicoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
nullbits_bit_c_propicoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
nullbits_bit_c_propicoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
nullbits_bit_c_propicoprobe.menu.opt.Debug=Debug (-Og)
nullbits_bit_c_propicoprobe.menu.opt.Debug.build.flags.optimize=-Og
nullbits_bit_c_propicoprobe.menu.rtti.Disabled=Disabled
nullbits_bit_c_propicoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
nullbits_bit_c_propicoprobe.menu.rtti.Enabled=Enabled
nullbits_bit_c_propicoprobe.menu.rtti.Enabled.build.flags.rtti=
nullbits_bit_c_propicoprobe.menu.stackprotect.Disabled=Disabled
nullbits_bit_c_propicoprobe.menu.stackprotect.Disabled.build.flags.stackprotect=
nullbits_bit_c_propicoprobe.menu.stackprotect.Enabled=Enabled
nullbits_bit_c_propicoprobe.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
nullbits_bit_c_propicoprobe.menu.exceptions.Disabled=Disabled
nullbits_bit_c_propicoprobe.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
nullbits_bit_c_propicoprobe.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
nullbits_bit_c_propicoprobe.menu.exceptions.Enabled=Enabled
nullbits_bit_c_propicoprobe.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
nullbits_bit_c_propicoprobe.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
nullbits_bit_c_propicoprobe.menu.dbgport.Disabled=Disabled
nullbits_bit_c_propicoprobe.menu.dbgport.Disabled.build.debug_port=
nullbits_bit_c_propicoprobe.menu.dbgport.Serial=Serial
nullbits_bit_c_propicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
nullbits_bit_c_propicoprobe.menu.dbgport.Serial1=Serial1
nullbits_bit_c_propicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
nullbits_bit_c_propicoprobe.menu.dbgport.Serial2=Serial2
nullbits_bit_c_propicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
nullbits_bit_c_propicoprobe.menu.dbglvl.None=None
nullbits_bit_c_propicoprobe.menu.dbglvl.None.build.debug_level=
nullbits_bit_c_propicoprobe.menu.dbglvl.Core=Core
nullbits_bit_c_propicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
nullbits_bit_c_propicoprobe.menu.dbglvl.SPI=SPI
nullbits_bit_c_propicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
nullbits_bit_c_propicoprobe.menu.dbglvl.Wire=Wire
nullbits_bit_c_propicoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
nullbits_bit_c_propicoprobe.menu.dbglvl.All=All
nullbits_bit_c_propicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
nullbits_bit_c_propicoprobe.menu.dbglvl.NDEBUG=NDEBUG
nullbits_bit_c_propicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
nullbits_bit_c_propicoprobe.menu.usbstack.picosdk=Pico SDK
nullbits_bit_c_propicoprobe.menu.usbstack.picosdk.build.usbstack_flags=
nullbits_bit_c_propicoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
nullbits_bit_c_propicoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
nullbits_bit_c_propicoprobe.menu.usbstack.nousb=No USB
nullbits_bit_c_propicoprobe.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
nullbits_bit_c_propicoprobe.menu.ipstack.ipv4only=IPv4 Only
nullbits_bit_c_propicoprobe.menu.ipstack.ipv4only.build.libpico=libpico.a
nullbits_bit_c_propicoprobe.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
nullbits_bit_c_propicoprobe.menu.ipstack.ipv4ipv6=IPv4 and IPv6
nullbits_bit_c_propicoprobe.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
nullbits_bit_c_propicoprobe.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

