earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Pimoroni PGA2040 (Picoprobe)
# -----------------------------------
pimoroni_pga2040picoprobe.name=Pimoroni PGA2040 (Picoprobe)
pimoroni_pga2040picoprobe.vid.0=0x2e8a
pimoroni_pga2040picoprobe.pid.0=0x0004
pimoroni_pga2040picoprobe.vid.1=0x2e8a
pimoroni_pga2040picoprobe.pid.1=0x0104
pimoroni_pga2040picoprobe.vid.2=0x2e8a
pimoroni_pga2040picoprobe.pid.2=0x4004
pimoroni_pga2040picoprobe.vid.3=0x2e8a
pimoroni_pga2040picoprobe.pid.3=0x4104
pimoroni_pga2040picoprobe.vid.4=0x2e8a
pimoroni_pga2040picoprobe.pid.4=0x8004
pimoroni_pga2040picoprobe.vid.5=0x2e8a
pimoroni_pga2040picoprobe.pid.5=0x8104
pimoroni_pga2040picoprobe.vid.6=0x2e8a
pimoroni_pga2040picoprobe.pid.6=0xc004
pimoroni_pga2040picoprobe.vid.7=0x2e8a
pimoroni_pga2040picoprobe.pid.7=0xc104
pimoroni_pga2040picoprobe.build.usbpid=-DSERIALUSB_PID=0x1008
pimoroni_pga2040picoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=250
pimoroni_pga2040picoprobe.build.board=PIMORONI_PGA2040
pimoroni_pga2040picoprobe.build.mcu=cortex-m0plus
pimoroni_pga2040picoprobe.build.variant=pimoroni_pga2040
pimoroni_pga2040picoprobe.upload.tool=picoprobe
pimoroni_pga2040picoprobe.upload.tool.default=picoprobe
pimoroni_pga2040picoprobe.upload.maximum_size=8388608
pimoroni_pga2040picoprobe.upload.maximum_data_size=262144
pimoroni_pga2040picoprobe.upload.wait_for_upload_port=true
pimoroni_pga2040picoprobe.upload.erase_cmd=
pimoroni_pga2040picoprobe.serial.disableDTR=false
pimoroni_pga2040picoprobe.serial.disableRTS=false
pimoroni_pga2040picoprobe.build.f_cpu=125000000
pimoroni_pga2040picoprobe.build.led=
pimoroni_pga2040picoprobe.build.core=rp2040
pimoroni_pga2040picoprobe.build.ldscript=memmap_default.ld
pimoroni_pga2040picoprobe.build.ram_length=256k
pimoroni_pga2040picoprobe.build.debugscript=picoprobe.tcl
pimoroni_pga2040picoprobe.build.boot2=boot2_w25q64jv_4_padded_checksum
pimoroni_pga2040picoprobe.build.vid=0x2e8a
pimoroni_pga2040picoprobe.build.pid=0x1008
pimoroni_pga2040picoprobe.build.usb_manufacturer="Pimoroni"
pimoroni_pga2040picoprobe.build.usb_product="PGA2040 (Picoprobe)"
pimoroni_pga2040picoprobe.menu.flash.8388608_0=8MB (no FS)
pimoroni_pga2040picoprobe.menu.flash.8388608_0.upload.maximum_size=8384512
pimoroni_pga2040picoprobe.menu.flash.8388608_0.build.flash_length=8384512
pimoroni_pga2040picoprobe.menu.flash.8388608_0.build.eeprom_start=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_0.build.fs_start=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_0.build.fs_end=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
pimoroni_pga2040picoprobe.menu.flash.8388608_65536.upload.maximum_size=8318976
pimoroni_pga2040picoprobe.menu.flash.8388608_65536.build.flash_length=8318976
pimoroni_pga2040picoprobe.menu.flash.8388608_65536.build.eeprom_start=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_65536.build.fs_start=276754432
pimoroni_pga2040picoprobe.menu.flash.8388608_65536.build.fs_end=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
pimoroni_pga2040picoprobe.menu.flash.8388608_131072.upload.maximum_size=8253440
pimoroni_pga2040picoprobe.menu.flash.8388608_131072.build.flash_length=8253440
pimoroni_pga2040picoprobe.menu.flash.8388608_131072.build.eeprom_start=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_131072.build.fs_start=276688896
pimoroni_pga2040picoprobe.menu.flash.8388608_131072.build.fs_end=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
pimoroni_pga2040picoprobe.menu.flash.8388608_262144.upload.maximum_size=8122368
pimoroni_pga2040picoprobe.menu.flash.8388608_262144.build.flash_length=8122368
pimoroni_pga2040picoprobe.menu.flash.8388608_262144.build.eeprom_start=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_262144.build.fs_start=276557824
pimoroni_pga2040picoprobe.menu.flash.8388608_262144.build.fs_end=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
pimoroni_pga2040picoprobe.menu.flash.8388608_524288.upload.maximum_size=7860224
pimoroni_pga2040picoprobe.menu.flash.8388608_524288.build.flash_length=7860224
pimoroni_pga2040picoprobe.menu.flash.8388608_524288.build.eeprom_start=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_524288.build.fs_start=276295680
pimoroni_pga2040picoprobe.menu.flash.8388608_524288.build.fs_end=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
pimoroni_pga2040picoprobe.menu.flash.8388608_1048576.upload.maximum_size=7335936
pimoroni_pga2040picoprobe.menu.flash.8388608_1048576.build.flash_length=7335936
pimoroni_pga2040picoprobe.menu.flash.8388608_1048576.build.eeprom_start=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_1048576.build.fs_start=275771392
pimoroni_pga2040picoprobe.menu.flash.8388608_1048576.build.fs_end=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
pimoroni_pga2040picoprobe.menu.flash.8388608_2097152.upload.maximum_size=6287360
pimoroni_pga2040picoprobe.menu.flash.8388608_2097152.build.flash_length=6287360
pimoroni_pga2040picoprobe.menu.flash.8388608_2097152.build.eeprom_start=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_2097152.build.fs_start=274722816
pimoroni_pga2040picoprobe.menu.flash.8388608_2097152.build.fs_end=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
pimoroni_pga2040picoprobe.menu.flash.8388608_3145728.upload.maximum_size=5238784
pimoroni_pga2040picoprobe.menu.flash.8388608_3145728.build.flash_length=5238784
pimoroni_pga2040picoprobe.menu.flash.8388608_3145728.build.eeprom_start=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_3145728.build.fs_start=273674240
pimoroni_pga2040picoprobe.menu.flash.8388608_3145728.build.fs_end=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
pimoroni_pga2040picoprobe.menu.flash.8388608_4194304.upload.maximum_size=4190208
pimoroni_pga2040picoprobe.menu.flash.8388608_4194304.build.flash_length=4190208
pimoroni_pga2040picoprobe.menu.flash.8388608_4194304.build.eeprom_start=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_4194304.build.fs_start=272625664
pimoroni_pga2040picoprobe.menu.flash.8388608_4194304.build.fs_end=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
pimoroni_pga2040picoprobe.menu.flash.8388608_5242880.upload.maximum_size=3141632
pimoroni_pga2040picoprobe.menu.flash.8388608_5242880.build.flash_length=3141632
pimoroni_pga2040picoprobe.menu.flash.8388608_5242880.build.eeprom_start=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_5242880.build.fs_start=271577088
pimoroni_pga2040picoprobe.menu.flash.8388608_5242880.build.fs_end=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
pimoroni_pga2040picoprobe.menu.flash.8388608_6291456.upload.maximum_size=2093056
pimoroni_pga2040picoprobe.menu.flash.8388608_6291456.build.flash_length=2093056
pimoroni_pga2040picoprobe.menu.flash.8388608_6291456.build.eeprom_start=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_6291456.build.fs_start=270528512
pimoroni_pga2040picoprobe.menu.flash.8388608_6291456.build.fs_end=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
pimoroni_pga2040picoprobe.menu.flash.8388608_7340032.upload.maximum_size=1044480
pimoroni_pga2040picoprobe.menu.flash.8388608_7340032.build.flash_length=1044480
pimoroni_pga2040picoprobe.menu.flash.8388608_7340032.build.eeprom_start=276819968
pimoroni_pga2040picoprobe.menu.flash.8388608_7340032.build.fs_start=269479936
pimoroni_pga2040picoprobe.menu.flash.8388608_7340032.build.fs_end=276819968
pimoroni_pga2040picoprobe.menu.freq.133=133 MHz
pimoroni_pga2040picoprobe.menu.freq.133.build.f_cpu=133000000L
pimoroni_pga2040picoprobe.menu.freq.50=50 MHz
pimoroni_pga2040picoprobe.menu.freq.50.build.f_cpu=50000000L
pimoroni_pga2040picoprobe.menu.freq.100=100 MHz
pimoroni_pga2040picoprobe.menu.freq.100.build.f_cpu=100000000L
pimoroni_pga2040picoprobe.menu.freq.120=120 MHz
pimoroni_pga2040picoprobe.menu.freq.120.build.f_cpu=120000000L
pimoroni_pga2040picoprobe.menu.freq.125=125 MHz
pimoroni_pga2040picoprobe.menu.freq.125.build.f_cpu=125000000L
pimoroni_pga2040picoprobe.menu.freq.150=150 MHz (Overclock)
pimoroni_pga2040picoprobe.menu.freq.150.build.f_cpu=150000000L
pimoroni_pga2040picoprobe.menu.freq.175=175 MHz (Overclock)
pimoroni_pga2040picoprobe.menu.freq.175.build.f_cpu=175000000L
pimoroni_pga2040picoprobe.menu.freq.200=200 MHz (Overclock)
pimoroni_pga2040picoprobe.menu.freq.200.build.f_cpu=200000000L
pimoroni_pga2040picoprobe.menu.freq.225=225 MHz (Overclock)
pimoroni_pga2040picoprobe.menu.freq.225.build.f_cpu=225000000L
pimoroni_pga2040picoprobe.menu.freq.240=240 MHz (Overclock)
pimoroni_pga2040picoprobe.menu.freq.240.build.f_cpu=240000000L
pimoroni_pga2040picoprobe.menu.freq.250=250 MHz (Overclock)
pimoroni_pga2040picoprobe.menu.freq.250.build.f_cpu=250000000L
pimoroni_pga2040picoprobe.menu.freq.275=275 MHz (Overclock)
pimoroni_pga2040picoprobe.menu.freq.275.build.f_cpu=275000000L
pimoroni_pga2040picoprobe.menu.freq.300=300 MHz (Overclock)
pimoroni_pga2040picoprobe.menu.freq.300.build.f_cpu=300000000L
pimoroni_pga2040picoprobe.menu.opt.Small=Small (-Os) (standard)
pimoroni_pga2040picoprobe.menu.opt.Small.build.flags.optimize=-Os
pimoroni_pga2040picoprobe.menu.opt.Optimize=Optimize (-O)
pimoroni_pga2040picoprobe.menu.opt.Optimize.build.flags.optimize=-O
pimoroni_pga2040picoprobe.menu.opt.Optimize2=Optimize More (-O2)
pimoroni_pga2040picoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
pimoroni_pga2040picoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
pimoroni_pga2040picoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
pimoroni_pga2040picoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
pimoroni_pga2040picoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
pimoroni_pga2040picoprobe.menu.opt.Debug=Debug (-Og)
pimoroni_pga2040picoprobe.menu.opt.Debug.build.flags.optimize=-Og
pimoroni_pga2040picoprobe.menu.rtti.Disabled=Disabled
pimoroni_pga2040picoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
pimoroni_pga2040picoprobe.menu.rtti.Enabled=Enabled
pimoroni_pga2040picoprobe.menu.rtti.Enabled.build.flags.rtti=
pimoroni_pga2040picoprobe.menu.stackprotect.Disabled=Disabled
pimoroni_pga2040picoprobe.menu.stackprotect.Disabled.build.flags.stackprotect=
pimoroni_pga2040picoprobe.menu.stackprotect.Enabled=Enabled
pimoroni_pga2040picoprobe.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
pimoroni_pga2040picoprobe.menu.exceptions.Disabled=Disabled
pimoroni_pga2040picoprobe.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
pimoroni_pga2040picoprobe.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
pimoroni_pga2040picoprobe.menu.exceptions.Enabled=Enabled
pimoroni_pga2040picoprobe.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
pimoroni_pga2040picoprobe.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
pimoroni_pga2040picoprobe.menu.dbgport.Disabled=Disabled
pimoroni_pga2040picoprobe.menu.dbgport.Disabled.build.debug_port=
pimoroni_pga2040picoprobe.menu.dbgport.Serial=Serial
pimoroni_pga2040picoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
pimoroni_pga2040picoprobe.menu.dbgport.Serial1=Serial1
pimoroni_pga2040picoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
pimoroni_pga2040picoprobe.menu.dbgport.Serial2=Serial2
pimoroni_pga2040picoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
pimoroni_pga2040picoprobe.menu.dbglvl.None=None
pimoroni_pga2040picoprobe.menu.dbglvl.None.build.debug_level=
pimoroni_pga2040picoprobe.menu.dbglvl.Core=Core
pimoroni_pga2040picoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
pimoroni_pga2040picoprobe.menu.dbglvl.SPI=SPI
pimoroni_pga2040picoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
pimoroni_pga2040picoprobe.menu.dbglvl.Wire=Wire
pimoroni_pga2040picoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
pimoroni_pga2040picoprobe.menu.dbglvl.All=All
pimoroni_pga2040picoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
pimoroni_pga2040picoprobe.menu.dbglvl.NDEBUG=NDEBUG
pimoroni_pga2040picoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
pimoroni_pga2040picoprobe.menu.usbstack.picosdk=Pico SDK
pimoroni_pga2040picoprobe.menu.usbstack.picosdk.build.usbstack_flags=
pimoroni_pga2040picoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
pimoroni_pga2040picoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
pimoroni_pga2040picoprobe.menu.usbstack.nousb=No USB
pimoroni_pga2040picoprobe.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
pimoroni_pga2040picoprobe.menu.ipstack.ipv4only=IPv4 Only
pimoroni_pga2040picoprobe.menu.ipstack.ipv4only.build.libpico=libpico.a
pimoroni_pga2040picoprobe.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
pimoroni_pga2040picoprobe.menu.ipstack.ipv4ipv6=IPv4 and IPv6
pimoroni_pga2040picoprobe.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
pimoroni_pga2040picoprobe.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

