earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Viyalab Mizu RP2040 (Picoprobe)
# -----------------------------------
viyalab_mizupicoprobe.name=Viyalab Mizu RP2040 (Picoprobe)
viyalab_mizupicoprobe.vid.0=0x2e8a
viyalab_mizupicoprobe.pid.0=0x0004
viyalab_mizupicoprobe.vid.1=0x2e8a
viyalab_mizupicoprobe.pid.1=0x0104
viyalab_mizupicoprobe.vid.2=0x2e8a
viyalab_mizupicoprobe.pid.2=0x4004
viyalab_mizupicoprobe.vid.3=0x2e8a
viyalab_mizupicoprobe.pid.3=0x4104
viyalab_mizupicoprobe.vid.4=0x2e8a
viyalab_mizupicoprobe.pid.4=0x8004
viyalab_mizupicoprobe.vid.5=0x2e8a
viyalab_mizupicoprobe.pid.5=0x8104
viyalab_mizupicoprobe.vid.6=0x2e8a
viyalab_mizupicoprobe.pid.6=0xc004
viyalab_mizupicoprobe.vid.7=0x2e8a
viyalab_mizupicoprobe.pid.7=0xc104
viyalab_mizupicoprobe.build.usbpid=-DSERIALUSB_PID=0x000a
viyalab_mizupicoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=250
viyalab_mizupicoprobe.build.board=VIYALAB_MIZU_RP2040
viyalab_mizupicoprobe.build.mcu=cortex-m0plus
viyalab_mizupicoprobe.build.variant=viyalab_mizu
viyalab_mizupicoprobe.upload.tool=picoprobe
viyalab_mizupicoprobe.upload.tool.default=picoprobe
viyalab_mizupicoprobe.upload.maximum_size=8388608
viyalab_mizupicoprobe.upload.maximum_data_size=262144
viyalab_mizupicoprobe.upload.wait_for_upload_port=true
viyalab_mizupicoprobe.upload.erase_cmd=
viyalab_mizupicoprobe.serial.disableDTR=false
viyalab_mizupicoprobe.serial.disableRTS=false
viyalab_mizupicoprobe.build.f_cpu=125000000
viyalab_mizupicoprobe.build.led=
viyalab_mizupicoprobe.build.core=rp2040
viyalab_mizupicoprobe.build.ldscript=memmap_default.ld
viyalab_mizupicoprobe.build.ram_length=256k
viyalab_mizupicoprobe.build.debugscript=picoprobe.tcl
viyalab_mizupicoprobe.build.boot2=boot2_generic_03h_4_padded_checksum
viyalab_mizupicoprobe.build.vid=0x2e8a
viyalab_mizupicoprobe.build.pid=0x000a
viyalab_mizupicoprobe.build.usb_manufacturer="Viyalab"
viyalab_mizupicoprobe.build.usb_product="Mizu RP2040 (Picoprobe)"
viyalab_mizupicoprobe.menu.flash.8388608_0=8MB (no FS)
viyalab_mizupicoprobe.menu.flash.8388608_0.upload.maximum_size=8384512
viyalab_mizupicoprobe.menu.flash.8388608_0.build.flash_length=8384512
viyalab_mizupicoprobe.menu.flash.8388608_0.build.eeprom_start=276819968
viyalab_mizupicoprobe.menu.flash.8388608_0.build.fs_start=276819968
viyalab_mizupicoprobe.menu.flash.8388608_0.build.fs_end=276819968
viyalab_mizupicoprobe.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
viyalab_mizupicoprobe.menu.flash.8388608_65536.upload.maximum_size=8318976
viyalab_mizupicoprobe.menu.flash.8388608_65536.build.flash_length=8318976
viyalab_mizupicoprobe.menu.flash.8388608_65536.build.eeprom_start=276819968
viyalab_mizupicoprobe.menu.flash.8388608_65536.build.fs_start=276754432
viyalab_mizupicoprobe.menu.flash.8388608_65536.build.fs_end=276819968
viyalab_mizupicoprobe.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
viyalab_mizupicoprobe.menu.flash.8388608_131072.upload.maximum_size=8253440
viyalab_mizupicoprobe.menu.flash.8388608_131072.build.flash_length=8253440
viyalab_mizupicoprobe.menu.flash.8388608_131072.build.eeprom_start=276819968
viyalab_mizupicoprobe.menu.flash.8388608_131072.build.fs_start=276688896
viyalab_mizupicoprobe.menu.flash.8388608_131072.build.fs_end=276819968
viyalab_mizupicoprobe.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
viyalab_mizupicoprobe.menu.flash.8388608_262144.upload.maximum_size=8122368
viyalab_mizupicoprobe.menu.flash.8388608_262144.build.flash_length=8122368
viyalab_mizupicoprobe.menu.flash.8388608_262144.build.eeprom_start=276819968
viyalab_mizupicoprobe.menu.flash.8388608_262144.build.fs_start=276557824
viyalab_mizupicoprobe.menu.flash.8388608_262144.build.fs_end=276819968
viyalab_mizupicoprobe.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
viyalab_mizupicoprobe.menu.flash.8388608_524288.upload.maximum_size=7860224
viyalab_mizupicoprobe.menu.flash.8388608_524288.build.flash_length=7860224
viyalab_mizupicoprobe.menu.flash.8388608_524288.build.eeprom_start=276819968
viyalab_mizupicoprobe.menu.flash.8388608_524288.build.fs_start=276295680
viyalab_mizupicoprobe.menu.flash.8388608_524288.build.fs_end=276819968
viyalab_mizupicoprobe.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
viyalab_mizupicoprobe.menu.flash.8388608_1048576.upload.maximum_size=7335936
viyalab_mizupicoprobe.menu.flash.8388608_1048576.build.flash_length=7335936
viyalab_mizupicoprobe.menu.flash.8388608_1048576.build.eeprom_start=276819968
viyalab_mizupicoprobe.menu.flash.8388608_1048576.build.fs_start=275771392
viyalab_mizupicoprobe.menu.flash.8388608_1048576.build.fs_end=276819968
viyalab_mizupicoprobe.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
viyalab_mizupicoprobe.menu.flash.8388608_2097152.upload.maximum_size=6287360
viyalab_mizupicoprobe.menu.flash.8388608_2097152.build.flash_length=6287360
viyalab_mizupicoprobe.menu.flash.8388608_2097152.build.eeprom_start=276819968
viyalab_mizupicoprobe.menu.flash.8388608_2097152.build.fs_start=274722816
viyalab_mizupicoprobe.menu.flash.8388608_2097152.build.fs_end=276819968
viyalab_mizupicoprobe.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
viyalab_mizupicoprobe.menu.flash.8388608_3145728.upload.maximum_size=5238784
viyalab_mizupicoprobe.menu.flash.8388608_3145728.build.flash_length=5238784
viyalab_mizupicoprobe.menu.flash.8388608_3145728.build.eeprom_start=276819968
viyalab_mizupicoprobe.menu.flash.8388608_3145728.build.fs_start=273674240
viyalab_mizupicoprobe.menu.flash.8388608_3145728.build.fs_end=276819968
viyalab_mizupicoprobe.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
viyalab_mizupicoprobe.menu.flash.8388608_4194304.upload.maximum_size=4190208
viyalab_mizupicoprobe.menu.flash.8388608_4194304.build.flash_length=4190208
viyalab_mizupicoprobe.menu.flash.8388608_4194304.build.eeprom_start=276819968
viyalab_mizupicoprobe.menu.flash.8388608_4194304.build.fs_start=272625664
viyalab_mizupicoprobe.menu.flash.8388608_4194304.build.fs_end=276819968
viyalab_mizupicoprobe.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
viyalab_mizupicoprobe.menu.flash.8388608_5242880.upload.maximum_size=3141632
viyalab_mizupicoprobe.menu.flash.8388608_5242880.build.flash_length=3141632
viyalab_mizupicoprobe.menu.flash.8388608_5242880.build.eeprom_start=276819968
viyalab_mizupicoprobe.menu.flash.8388608_5242880.build.fs_start=271577088
viyalab_mizupicoprobe.menu.flash.8388608_5242880.build.fs_end=276819968
viyalab_mizupicoprobe.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
viyalab_mizupicoprobe.menu.flash.8388608_6291456.upload.maximum_size=2093056
viyalab_mizupicoprobe.menu.flash.8388608_6291456.build.flash_length=2093056
viyalab_mizupicoprobe.menu.flash.8388608_6291456.build.eeprom_start=276819968
viyalab_mizupicoprobe.menu.flash.8388608_6291456.build.fs_start=270528512
viyalab_mizupicoprobe.menu.flash.8388608_6291456.build.fs_end=276819968
viyalab_mizupicoprobe.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
viyalab_mizupicoprobe.menu.flash.8388608_7340032.upload.maximum_size=1044480
viyalab_mizupicoprobe.menu.flash.8388608_7340032.build.flash_length=1044480
viyalab_mizupicoprobe.menu.flash.8388608_7340032.build.eeprom_start=276819968
viyalab_mizupicoprobe.menu.flash.8388608_7340032.build.fs_start=269479936
viyalab_mizupicoprobe.menu.flash.8388608_7340032.build.fs_end=276819968
viyalab_mizupicoprobe.menu.freq.133=133 MHz
viyalab_mizupicoprobe.menu.freq.133.build.f_cpu=133000000L
viyalab_mizupicoprobe.menu.freq.50=50 MHz
viyalab_mizupicoprobe.menu.freq.50.build.f_cpu=50000000L
viyalab_mizupicoprobe.menu.freq.100=100 MHz
viyalab_mizupicoprobe.menu.freq.100.build.f_cpu=100000000L
viyalab_mizupicoprobe.menu.freq.120=120 MHz
viyalab_mizupicoprobe.menu.freq.120.build.f_cpu=120000000L
viyalab_mizupicoprobe.menu.freq.125=125 MHz
viyalab_mizupicoprobe.menu.freq.125.build.f_cpu=125000000L
viyalab_mizupicoprobe.menu.freq.150=150 MHz (Overclock)
viyalab_mizupicoprobe.menu.freq.150.build.f_cpu=150000000L
viyalab_mizupicoprobe.menu.freq.175=175 MHz (Overclock)
viyalab_mizupicoprobe.menu.freq.175.build.f_cpu=175000000L
viyalab_mizupicoprobe.menu.freq.200=200 MHz (Overclock)
viyalab_mizupicoprobe.menu.freq.200.build.f_cpu=200000000L
viyalab_mizupicoprobe.menu.freq.225=225 MHz (Overclock)
viyalab_mizupicoprobe.menu.freq.225.build.f_cpu=225000000L
viyalab_mizupicoprobe.menu.freq.240=240 MHz (Overclock)
viyalab_mizupicoprobe.menu.freq.240.build.f_cpu=240000000L
viyalab_mizupicoprobe.menu.freq.250=250 MHz (Overclock)
viyalab_mizupicoprobe.menu.freq.250.build.f_cpu=250000000L
viyalab_mizupicoprobe.menu.freq.275=275 MHz (Overclock)
viyalab_mizupicoprobe.menu.freq.275.build.f_cpu=275000000L
viyalab_mizupicoprobe.menu.freq.300=300 MHz (Overclock)
viyalab_mizupicoprobe.menu.freq.300.build.f_cpu=300000000L
viyalab_mizupicoprobe.menu.opt.Small=Small (-Os) (standard)
viyalab_mizupicoprobe.menu.opt.Small.build.flags.optimize=-Os
viyalab_mizupicoprobe.menu.opt.Optimize=Optimize (-O)
viyalab_mizupicoprobe.menu.opt.Optimize.build.flags.optimize=-O
viyalab_mizupicoprobe.menu.opt.Optimize2=Optimize More (-O2)
viyalab_mizupicoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
viyalab_mizupicoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
viyalab_mizupicoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
viyalab_mizupicoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
viyalab_mizupicoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
viyalab_mizupicoprobe.menu.opt.Debug=Debug (-Og)
viyalab_mizupicoprobe.menu.opt.Debug.build.flags.optimize=-Og
viyalab_mizupicoprobe.menu.rtti.Disabled=Disabled
viyalab_mizupicoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
viyalab_mizupicoprobe.menu.rtti.Enabled=Enabled
viyalab_mizupicoprobe.menu.rtti.Enabled.build.flags.rtti=
viyalab_mizupicoprobe.menu.stackprotect.Disabled=Disabled
viyalab_mizupicoprobe.menu.stackprotect.Disabled.build.flags.stackprotect=
viyalab_mizupicoprobe.menu.stackprotect.Enabled=Enabled
viyalab_mizupicoprobe.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
viyalab_mizupicoprobe.menu.exceptions.Disabled=Disabled
viyalab_mizupicoprobe.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
viyalab_mizupicoprobe.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
viyalab_mizupicoprobe.menu.exceptions.Enabled=Enabled
viyalab_mizupicoprobe.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
viyalab_mizupicoprobe.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
viyalab_mizupicoprobe.menu.dbgport.Disabled=Disabled
viyalab_mizupicoprobe.menu.dbgport.Disabled.build.debug_port=
viyalab_mizupicoprobe.menu.dbgport.Serial=Serial
viyalab_mizupicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
viyalab_mizupicoprobe.menu.dbgport.Serial1=Serial1
viyalab_mizupicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
viyalab_mizupicoprobe.menu.dbgport.Serial2=Serial2
viyalab_mizupicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
viyalab_mizupicoprobe.menu.dbglvl.None=None
viyalab_mizupicoprobe.menu.dbglvl.None.build.debug_level=
viyalab_mizupicoprobe.menu.dbglvl.Core=Core
viyalab_mizupicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
viyalab_mizupicoprobe.menu.dbglvl.SPI=SPI
viyalab_mizupicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
viyalab_mizupicoprobe.menu.dbglvl.Wire=Wire
viyalab_mizupicoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
viyalab_mizupicoprobe.menu.dbglvl.All=All
viyalab_mizupicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
viyalab_mizupicoprobe.menu.dbglvl.NDEBUG=NDEBUG
viyalab_mizupicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
viyalab_mizupicoprobe.menu.usbstack.picosdk=Pico SDK
viyalab_mizupicoprobe.menu.usbstack.picosdk.build.usbstack_flags=
viyalab_mizupicoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
viyalab_mizupicoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
viyalab_mizupicoprobe.menu.usbstack.nousb=No USB
viyalab_mizupicoprobe.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
viyalab_mizupicoprobe.menu.ipstack.ipv4only=IPv4 Only
viyalab_mizupicoprobe.menu.ipstack.ipv4only.build.libpico=libpico.a
viyalab_mizupicoprobe.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
viyalab_mizupicoprobe.menu.ipstack.ipv4ipv6=IPv4 and IPv6
viyalab_mizupicoprobe.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
viyalab_mizupicoprobe.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

