earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Waveshare RP2040 Plus 4MB
# -----------------------------------
waveshare_rp2040_plus_4mb.name=Waveshare RP2040 Plus 4MB
waveshare_rp2040_plus_4mb.vid.0=0x2e8a
waveshare_rp2040_plus_4mb.pid.0=0x1020
waveshare_rp2040_plus_4mb.vid.1=0x2e8a
waveshare_rp2040_plus_4mb.pid.1=0x1120
waveshare_rp2040_plus_4mb.vid.2=0x2e8a
waveshare_rp2040_plus_4mb.pid.2=0x5020
waveshare_rp2040_plus_4mb.vid.3=0x2e8a
waveshare_rp2040_plus_4mb.pid.3=0x5120
waveshare_rp2040_plus_4mb.vid.4=0x2e8a
waveshare_rp2040_plus_4mb.pid.4=0x9020
waveshare_rp2040_plus_4mb.vid.5=0x2e8a
waveshare_rp2040_plus_4mb.pid.5=0x9120
waveshare_rp2040_plus_4mb.vid.6=0x2e8a
waveshare_rp2040_plus_4mb.pid.6=0xd020
waveshare_rp2040_plus_4mb.vid.7=0x2e8a
waveshare_rp2040_plus_4mb.pid.7=0xd120
waveshare_rp2040_plus_4mb.build.usbpid=-DSERIALUSB_PID=0x1020
waveshare_rp2040_plus_4mb.build.usbpwr=-DUSBD_MAX_POWER_MA=500
waveshare_rp2040_plus_4mb.build.board=WAVESHARE_RP2040_PLUS
waveshare_rp2040_plus_4mb.build.mcu=cortex-m0plus
waveshare_rp2040_plus_4mb.build.variant=waveshare_rp2040_plus_4mb
waveshare_rp2040_plus_4mb.upload.tool=uf2conv
waveshare_rp2040_plus_4mb.upload.tool.default=uf2conv
waveshare_rp2040_plus_4mb.upload.tool.network=uf2conv-network
waveshare_rp2040_plus_4mb.upload.maximum_size=4194304
waveshare_rp2040_plus_4mb.upload.maximum_data_size=262144
waveshare_rp2040_plus_4mb.upload.wait_for_upload_port=true
waveshare_rp2040_plus_4mb.upload.erase_cmd=
waveshare_rp2040_plus_4mb.serial.disableDTR=false
waveshare_rp2040_plus_4mb.serial.disableRTS=false
waveshare_rp2040_plus_4mb.build.f_cpu=125000000
waveshare_rp2040_plus_4mb.build.led=
waveshare_rp2040_plus_4mb.build.core=rp2040
waveshare_rp2040_plus_4mb.build.ldscript=memmap_default.ld
waveshare_rp2040_plus_4mb.build.ram_length=256k
waveshare_rp2040_plus_4mb.build.debugscript=picoprobe.tcl
waveshare_rp2040_plus_4mb.build.boot2=boot2_w25q080_2_padded_checksum
waveshare_rp2040_plus_4mb.build.vid=0x2e8a
waveshare_rp2040_plus_4mb.build.pid=0x1020
waveshare_rp2040_plus_4mb.build.usb_manufacturer="Waveshare"
waveshare_rp2040_plus_4mb.build.usb_product="RP2040 Plus 4MB"
waveshare_rp2040_plus_4mb.menu.flash.4194304_0=4MB (no FS)
waveshare_rp2040_plus_4mb.menu.flash.4194304_0.upload.maximum_size=4190208
waveshare_rp2040_plus_4mb.menu.flash.4194304_0.build.flash_length=4190208
waveshare_rp2040_plus_4mb.menu.flash.4194304_0.build.eeprom_start=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_0.build.fs_start=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_0.build.fs_end=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_65536=4MB (Sketch: 4032KB, FS: 64KB)
waveshare_rp2040_plus_4mb.menu.flash.4194304_65536.upload.maximum_size=4124672
waveshare_rp2040_plus_4mb.menu.flash.4194304_65536.build.flash_length=4124672
waveshare_rp2040_plus_4mb.menu.flash.4194304_65536.build.eeprom_start=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_65536.build.fs_start=272560128
waveshare_rp2040_plus_4mb.menu.flash.4194304_65536.build.fs_end=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_131072=4MB (Sketch: 3968KB, FS: 128KB)
waveshare_rp2040_plus_4mb.menu.flash.4194304_131072.upload.maximum_size=4059136
waveshare_rp2040_plus_4mb.menu.flash.4194304_131072.build.flash_length=4059136
waveshare_rp2040_plus_4mb.menu.flash.4194304_131072.build.eeprom_start=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_131072.build.fs_start=272494592
waveshare_rp2040_plus_4mb.menu.flash.4194304_131072.build.fs_end=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_262144=4MB (Sketch: 3840KB, FS: 256KB)
waveshare_rp2040_plus_4mb.menu.flash.4194304_262144.upload.maximum_size=3928064
waveshare_rp2040_plus_4mb.menu.flash.4194304_262144.build.flash_length=3928064
waveshare_rp2040_plus_4mb.menu.flash.4194304_262144.build.eeprom_start=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_262144.build.fs_start=272363520
waveshare_rp2040_plus_4mb.menu.flash.4194304_262144.build.fs_end=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_524288=4MB (Sketch: 3584KB, FS: 512KB)
waveshare_rp2040_plus_4mb.menu.flash.4194304_524288.upload.maximum_size=3665920
waveshare_rp2040_plus_4mb.menu.flash.4194304_524288.build.flash_length=3665920
waveshare_rp2040_plus_4mb.menu.flash.4194304_524288.build.eeprom_start=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_524288.build.fs_start=272101376
waveshare_rp2040_plus_4mb.menu.flash.4194304_524288.build.fs_end=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_1048576=4MB (Sketch: 3MB, FS: 1MB)
waveshare_rp2040_plus_4mb.menu.flash.4194304_1048576.upload.maximum_size=3141632
waveshare_rp2040_plus_4mb.menu.flash.4194304_1048576.build.flash_length=3141632
waveshare_rp2040_plus_4mb.menu.flash.4194304_1048576.build.eeprom_start=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_1048576.build.fs_start=271577088
waveshare_rp2040_plus_4mb.menu.flash.4194304_1048576.build.fs_end=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
waveshare_rp2040_plus_4mb.menu.flash.4194304_2097152.upload.maximum_size=2093056
waveshare_rp2040_plus_4mb.menu.flash.4194304_2097152.build.flash_length=2093056
waveshare_rp2040_plus_4mb.menu.flash.4194304_2097152.build.eeprom_start=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_2097152.build.fs_start=270528512
waveshare_rp2040_plus_4mb.menu.flash.4194304_2097152.build.fs_end=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
waveshare_rp2040_plus_4mb.menu.flash.4194304_3145728.upload.maximum_size=1044480
waveshare_rp2040_plus_4mb.menu.flash.4194304_3145728.build.flash_length=1044480
waveshare_rp2040_plus_4mb.menu.flash.4194304_3145728.build.eeprom_start=272625664
waveshare_rp2040_plus_4mb.menu.flash.4194304_3145728.build.fs_start=269479936
waveshare_rp2040_plus_4mb.menu.flash.4194304_3145728.build.fs_end=272625664
waveshare_rp2040_plus_4mb.menu.freq.133=133 MHz
waveshare_rp2040_plus_4mb.menu.freq.133.build.f_cpu=133000000L
waveshare_rp2040_plus_4mb.menu.freq.50=50 MHz
waveshare_rp2040_plus_4mb.menu.freq.50.build.f_cpu=50000000L
waveshare_rp2040_plus_4mb.menu.freq.100=100 MHz
waveshare_rp2040_plus_4mb.menu.freq.100.build.f_cpu=100000000L
waveshare_rp2040_plus_4mb.menu.freq.120=120 MHz
waveshare_rp2040_plus_4mb.menu.freq.120.build.f_cpu=120000000L
waveshare_rp2040_plus_4mb.menu.freq.125=125 MHz
waveshare_rp2040_plus_4mb.menu.freq.125.build.f_cpu=125000000L
waveshare_rp2040_plus_4mb.menu.freq.150=150 MHz (Overclock)
waveshare_rp2040_plus_4mb.menu.freq.150.build.f_cpu=150000000L
waveshare_rp2040_plus_4mb.menu.freq.175=175 MHz (Overclock)
waveshare_rp2040_plus_4mb.menu.freq.175.build.f_cpu=175000000L
waveshare_rp2040_plus_4mb.menu.freq.200=200 MHz (Overclock)
waveshare_rp2040_plus_4mb.menu.freq.200.build.f_cpu=200000000L
waveshare_rp2040_plus_4mb.menu.freq.225=225 MHz (Overclock)
waveshare_rp2040_plus_4mb.menu.freq.225.build.f_cpu=225000000L
waveshare_rp2040_plus_4mb.menu.freq.240=240 MHz (Overclock)
waveshare_rp2040_plus_4mb.menu.freq.240.build.f_cpu=240000000L
waveshare_rp2040_plus_4mb.menu.freq.250=250 MHz (Overclock)
waveshare_rp2040_plus_4mb.menu.freq.250.build.f_cpu=250000000L
waveshare_rp2040_plus_4mb.menu.freq.275=275 MHz (Overclock)
waveshare_rp2040_plus_4mb.menu.freq.275.build.f_cpu=275000000L
waveshare_rp2040_plus_4mb.menu.freq.300=300 MHz (Overclock)
waveshare_rp2040_plus_4mb.menu.freq.300.build.f_cpu=300000000L
waveshare_rp2040_plus_4mb.menu.opt.Small=Small (-Os) (standard)
waveshare_rp2040_plus_4mb.menu.opt.Small.build.flags.optimize=-Os
waveshare_rp2040_plus_4mb.menu.opt.Optimize=Optimize (-O)
waveshare_rp2040_plus_4mb.menu.opt.Optimize.build.flags.optimize=-O
waveshare_rp2040_plus_4mb.menu.opt.Optimize2=Optimize More (-O2)
waveshare_rp2040_plus_4mb.menu.opt.Optimize2.build.flags.optimize=-O2
waveshare_rp2040_plus_4mb.menu.opt.Optimize3=Optimize Even More (-O3)
waveshare_rp2040_plus_4mb.menu.opt.Optimize3.build.flags.optimize=-O3
waveshare_rp2040_plus_4mb.menu.opt.Fast=Fast (-Ofast) (maybe slower)
waveshare_rp2040_plus_4mb.menu.opt.Fast.build.flags.optimize=-Ofast
waveshare_rp2040_plus_4mb.menu.opt.Debug=Debug (-Og)
waveshare_rp2040_plus_4mb.menu.opt.Debug.build.flags.optimize=-Og
waveshare_rp2040_plus_4mb.menu.rtti.Disabled=Disabled
waveshare_rp2040_plus_4mb.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
waveshare_rp2040_plus_4mb.menu.rtti.Enabled=Enabled
waveshare_rp2040_plus_4mb.menu.rtti.Enabled.build.flags.rtti=
waveshare_rp2040_plus_4mb.menu.stackprotect.Disabled=Disabled
waveshare_rp2040_plus_4mb.menu.stackprotect.Disabled.build.flags.stackprotect=
waveshare_rp2040_plus_4mb.menu.stackprotect.Enabled=Enabled
waveshare_rp2040_plus_4mb.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
waveshare_rp2040_plus_4mb.menu.exceptions.Disabled=Disabled
waveshare_rp2040_plus_4mb.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
waveshare_rp2040_plus_4mb.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
waveshare_rp2040_plus_4mb.menu.exceptions.Enabled=Enabled
waveshare_rp2040_plus_4mb.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
waveshare_rp2040_plus_4mb.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
waveshare_rp2040_plus_4mb.menu.dbgport.Disabled=Disabled
waveshare_rp2040_plus_4mb.menu.dbgport.Disabled.build.debug_port=
waveshare_rp2040_plus_4mb.menu.dbgport.Serial=Serial
waveshare_rp2040_plus_4mb.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
waveshare_rp2040_plus_4mb.menu.dbgport.Serial1=Serial1
waveshare_rp2040_plus_4mb.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
waveshare_rp2040_plus_4mb.menu.dbgport.Serial2=Serial2
waveshare_rp2040_plus_4mb.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
waveshare_rp2040_plus_4mb.menu.dbglvl.None=None
waveshare_rp2040_plus_4mb.menu.dbglvl.None.build.debug_level=
waveshare_rp2040_plus_4mb.menu.dbglvl.Core=Core
waveshare_rp2040_plus_4mb.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
waveshare_rp2040_plus_4mb.menu.dbglvl.SPI=SPI
waveshare_rp2040_plus_4mb.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
waveshare_rp2040_plus_4mb.menu.dbglvl.Wire=Wire
waveshare_rp2040_plus_4mb.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
waveshare_rp2040_plus_4mb.menu.dbglvl.All=All
waveshare_rp2040_plus_4mb.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
waveshare_rp2040_plus_4mb.menu.dbglvl.NDEBUG=NDEBUG
waveshare_rp2040_plus_4mb.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
waveshare_rp2040_plus_4mb.menu.usbstack.picosdk=Pico SDK
waveshare_rp2040_plus_4mb.menu.usbstack.picosdk.build.usbstack_flags=
waveshare_rp2040_plus_4mb.menu.usbstack.tinyusb=Adafruit TinyUSB
waveshare_rp2040_plus_4mb.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
waveshare_rp2040_plus_4mb.menu.usbstack.nousb=No USB
waveshare_rp2040_plus_4mb.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
waveshare_rp2040_plus_4mb.menu.ipstack.ipv4only=IPv4 Only
waveshare_rp2040_plus_4mb.menu.ipstack.ipv4only.build.libpico=libpico.a
waveshare_rp2040_plus_4mb.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
waveshare_rp2040_plus_4mb.menu.ipstack.ipv4ipv6=IPv4 and IPv6
waveshare_rp2040_plus_4mb.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
waveshare_rp2040_plus_4mb.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

