earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Waveshare RP2040 Plus 16MB (Picoprobe)
# -----------------------------------
waveshare_rp2040_plus_16mbpicoprobe.name=Waveshare RP2040 Plus 16MB (Picoprobe)
waveshare_rp2040_plus_16mbpicoprobe.vid.0=0x2e8a
waveshare_rp2040_plus_16mbpicoprobe.pid.0=0x0004
waveshare_rp2040_plus_16mbpicoprobe.vid.1=0x2e8a
waveshare_rp2040_plus_16mbpicoprobe.pid.1=0x0104
waveshare_rp2040_plus_16mbpicoprobe.vid.2=0x2e8a
waveshare_rp2040_plus_16mbpicoprobe.pid.2=0x4004
waveshare_rp2040_plus_16mbpicoprobe.vid.3=0x2e8a
waveshare_rp2040_plus_16mbpicoprobe.pid.3=0x4104
waveshare_rp2040_plus_16mbpicoprobe.vid.4=0x2e8a
waveshare_rp2040_plus_16mbpicoprobe.pid.4=0x8004
waveshare_rp2040_plus_16mbpicoprobe.vid.5=0x2e8a
waveshare_rp2040_plus_16mbpicoprobe.pid.5=0x8104
waveshare_rp2040_plus_16mbpicoprobe.vid.6=0x2e8a
waveshare_rp2040_plus_16mbpicoprobe.pid.6=0xc004
waveshare_rp2040_plus_16mbpicoprobe.vid.7=0x2e8a
waveshare_rp2040_plus_16mbpicoprobe.pid.7=0xc104
waveshare_rp2040_plus_16mbpicoprobe.build.usbpid=-DSERIALUSB_PID=0x1020
waveshare_rp2040_plus_16mbpicoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=500
waveshare_rp2040_plus_16mbpicoprobe.build.board=WAVESHARE_RP2040_PLUS
waveshare_rp2040_plus_16mbpicoprobe.build.mcu=cortex-m0plus
waveshare_rp2040_plus_16mbpicoprobe.build.variant=waveshare_rp2040_plus_16mb
waveshare_rp2040_plus_16mbpicoprobe.upload.tool=picoprobe
waveshare_rp2040_plus_16mbpicoprobe.upload.tool.default=picoprobe
waveshare_rp2040_plus_16mbpicoprobe.upload.maximum_size=16777216
waveshare_rp2040_plus_16mbpicoprobe.upload.maximum_data_size=262144
waveshare_rp2040_plus_16mbpicoprobe.upload.wait_for_upload_port=true
waveshare_rp2040_plus_16mbpicoprobe.upload.erase_cmd=
waveshare_rp2040_plus_16mbpicoprobe.serial.disableDTR=false
waveshare_rp2040_plus_16mbpicoprobe.serial.disableRTS=false
waveshare_rp2040_plus_16mbpicoprobe.build.f_cpu=125000000
waveshare_rp2040_plus_16mbpicoprobe.build.led=
waveshare_rp2040_plus_16mbpicoprobe.build.core=rp2040
waveshare_rp2040_plus_16mbpicoprobe.build.ldscript=memmap_default.ld
waveshare_rp2040_plus_16mbpicoprobe.build.ram_length=256k
waveshare_rp2040_plus_16mbpicoprobe.build.debugscript=picoprobe.tcl
waveshare_rp2040_plus_16mbpicoprobe.build.boot2=boot2_w25q080_2_padded_checksum
waveshare_rp2040_plus_16mbpicoprobe.build.vid=0x2e8a
waveshare_rp2040_plus_16mbpicoprobe.build.pid=0x1020
waveshare_rp2040_plus_16mbpicoprobe.build.usb_manufacturer="Waveshare"
waveshare_rp2040_plus_16mbpicoprobe.build.usb_product="RP2040 Plus 16MB (Picoprobe)"
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_0=16MB (no FS)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_0.upload.maximum_size=16773120
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_0.build.flash_length=16773120
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_0.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_0.build.fs_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_0.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_65536.upload.maximum_size=16707584
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_65536.build.flash_length=16707584
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_65536.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_65536.build.fs_start=285143040
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_65536.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_131072.upload.maximum_size=16642048
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_131072.build.flash_length=16642048
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_131072.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_131072.build.fs_start=285077504
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_131072.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_262144.upload.maximum_size=16510976
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_262144.build.flash_length=16510976
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_262144.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_262144.build.fs_start=284946432
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_262144.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_524288.upload.maximum_size=16248832
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_524288.build.flash_length=16248832
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_524288.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_524288.build.fs_start=284684288
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_524288.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_1048576.upload.maximum_size=15724544
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_1048576.build.flash_length=15724544
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_1048576.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_1048576.build.fs_start=284160000
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_1048576.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_2097152.upload.maximum_size=14675968
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_2097152.build.flash_length=14675968
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_2097152.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_2097152.build.fs_start=283111424
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_2097152.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_3145728.upload.maximum_size=13627392
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_3145728.build.flash_length=13627392
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_3145728.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_3145728.build.fs_start=282062848
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_3145728.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_4194304.upload.maximum_size=12578816
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_4194304.build.flash_length=12578816
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_4194304.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_4194304.build.fs_start=281014272
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_4194304.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_5242880.upload.maximum_size=11530240
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_5242880.build.flash_length=11530240
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_5242880.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_5242880.build.fs_start=279965696
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_5242880.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_6291456.upload.maximum_size=10481664
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_6291456.build.flash_length=10481664
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_6291456.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_6291456.build.fs_start=278917120
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_6291456.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_7340032.upload.maximum_size=9433088
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_7340032.build.flash_length=9433088
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_7340032.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_7340032.build.fs_start=277868544
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_7340032.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_8388608.upload.maximum_size=8384512
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_8388608.build.flash_length=8384512
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_8388608.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_8388608.build.fs_start=276819968
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_8388608.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_9437184.upload.maximum_size=7335936
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_9437184.build.flash_length=7335936
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_9437184.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_9437184.build.fs_start=275771392
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_9437184.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_10485760.upload.maximum_size=6287360
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_10485760.build.flash_length=6287360
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_10485760.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_10485760.build.fs_start=274722816
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_10485760.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_11534336.upload.maximum_size=5238784
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_11534336.build.flash_length=5238784
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_11534336.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_11534336.build.fs_start=273674240
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_11534336.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_12582912.upload.maximum_size=4190208
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_12582912.build.flash_length=4190208
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_12582912.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_12582912.build.fs_start=272625664
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_12582912.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_13631488.upload.maximum_size=3141632
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_13631488.build.flash_length=3141632
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_13631488.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_13631488.build.fs_start=271577088
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_13631488.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_14680064.upload.maximum_size=2093056
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_14680064.build.flash_length=2093056
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_14680064.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_14680064.build.fs_start=270528512
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_14680064.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_15728640.upload.maximum_size=1044480
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_15728640.build.flash_length=1044480
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_15728640.build.eeprom_start=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_15728640.build.fs_start=269479936
waveshare_rp2040_plus_16mbpicoprobe.menu.flash.16777216_15728640.build.fs_end=285208576
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.133=133 MHz
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.133.build.f_cpu=133000000L
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.50=50 MHz
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.50.build.f_cpu=50000000L
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.100=100 MHz
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.100.build.f_cpu=100000000L
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.120=120 MHz
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.120.build.f_cpu=120000000L
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.125=125 MHz
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.125.build.f_cpu=125000000L
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.150=150 MHz (Overclock)
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.150.build.f_cpu=150000000L
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.175=175 MHz (Overclock)
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.175.build.f_cpu=175000000L
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.200=200 MHz (Overclock)
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.200.build.f_cpu=200000000L
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.225=225 MHz (Overclock)
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.225.build.f_cpu=225000000L
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.240=240 MHz (Overclock)
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.240.build.f_cpu=240000000L
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.250=250 MHz (Overclock)
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.250.build.f_cpu=250000000L
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.275=275 MHz (Overclock)
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.275.build.f_cpu=275000000L
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.300=300 MHz (Overclock)
waveshare_rp2040_plus_16mbpicoprobe.menu.freq.300.build.f_cpu=300000000L
waveshare_rp2040_plus_16mbpicoprobe.menu.opt.Small=Small (-Os) (standard)
waveshare_rp2040_plus_16mbpicoprobe.menu.opt.Small.build.flags.optimize=-Os
waveshare_rp2040_plus_16mbpicoprobe.menu.opt.Optimize=Optimize (-O)
waveshare_rp2040_plus_16mbpicoprobe.menu.opt.Optimize.build.flags.optimize=-O
waveshare_rp2040_plus_16mbpicoprobe.menu.opt.Optimize2=Optimize More (-O2)
waveshare_rp2040_plus_16mbpicoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
waveshare_rp2040_plus_16mbpicoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
waveshare_rp2040_plus_16mbpicoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
waveshare_rp2040_plus_16mbpicoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
waveshare_rp2040_plus_16mbpicoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
waveshare_rp2040_plus_16mbpicoprobe.menu.opt.Debug=Debug (-Og)
waveshare_rp2040_plus_16mbpicoprobe.menu.opt.Debug.build.flags.optimize=-Og
waveshare_rp2040_plus_16mbpicoprobe.menu.rtti.Disabled=Disabled
waveshare_rp2040_plus_16mbpicoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
waveshare_rp2040_plus_16mbpicoprobe.menu.rtti.Enabled=Enabled
waveshare_rp2040_plus_16mbpicoprobe.menu.rtti.Enabled.build.flags.rtti=
waveshare_rp2040_plus_16mbpicoprobe.menu.stackprotect.Disabled=Disabled
waveshare_rp2040_plus_16mbpicoprobe.menu.stackprotect.Disabled.build.flags.stackprotect=
waveshare_rp2040_plus_16mbpicoprobe.menu.stackprotect.Enabled=Enabled
waveshare_rp2040_plus_16mbpicoprobe.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
waveshare_rp2040_plus_16mbpicoprobe.menu.exceptions.Disabled=Disabled
waveshare_rp2040_plus_16mbpicoprobe.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
waveshare_rp2040_plus_16mbpicoprobe.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
waveshare_rp2040_plus_16mbpicoprobe.menu.exceptions.Enabled=Enabled
waveshare_rp2040_plus_16mbpicoprobe.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
waveshare_rp2040_plus_16mbpicoprobe.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
waveshare_rp2040_plus_16mbpicoprobe.menu.dbgport.Disabled=Disabled
waveshare_rp2040_plus_16mbpicoprobe.menu.dbgport.Disabled.build.debug_port=
waveshare_rp2040_plus_16mbpicoprobe.menu.dbgport.Serial=Serial
waveshare_rp2040_plus_16mbpicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
waveshare_rp2040_plus_16mbpicoprobe.menu.dbgport.Serial1=Serial1
waveshare_rp2040_plus_16mbpicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
waveshare_rp2040_plus_16mbpicoprobe.menu.dbgport.Serial2=Serial2
waveshare_rp2040_plus_16mbpicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
waveshare_rp2040_plus_16mbpicoprobe.menu.dbglvl.None=None
